package HW2;

import java.lang.reflect.Array;
import java.util.Arrays;

/**
 * Практическое задание
 * 1 Напишите метод, на вход которого подаётся двумерный строковый массив размером 4х4. При
 * подаче массива другого размера необходимо бросить исключение MyArraySizeException.
 * 2 Далее метод должен пройтись по всем элементам массива, преобразовать в int и
 * просуммировать. Если в каком-то элементе массива преобразование не удалось (например, в
 * ячейке лежит символ или текст вместо числа), должно быть брошено исключение
 * MyArrayDataException с детализацией, в какой именно ячейке лежат неверные данные.
 * 3 В методе main() вызвать полученный метод, обработать возможные исключения
 * MyArraySizeException и MyArrayDataException и вывести результат расчета (сумму элементов,
 * при условии что подали на вход корректный массив).
 * Заметка: Для преобразования строки к числу используйте статический метод класса Integer:
 * Integer.parseInt(сюда_подать_строку);
 * Заметка: Если Java не сможет преобразовать входную строку (в строке число криво написано), то
 * будет сгенерировано исключение NumberFormatException.
 */

public class hw2app {
    public static void main(String[] args) throws MyArraySizeException {
        String[][] massive = {
                {"1", "2", "3", "4"},
                {"5", "/6", "7", "8"},
                {"9", "10", "11", "12"},
                {"13", "14", "15", "16"}
        };
        MyArray array = new MyArray();
        try {
            array.setMassive(massive);
        } catch (MyArraySizeException e) {
            e.printStackTrace();
        }
        array.showSum();
    }
}
